BitNibble/STM32G473VET6/Support/stm32g4_register.h
#ifndef STM32G4_REGISTER_H
	#define STM32G4_REGISTER_H

#include <stdint.h>
#include <inttypes.h>
#include <stddef.h>

typedef union
{
    uint32_t val;

    struct {
        uint32_t DMA1EN               : 1;
        uint32_t DMA2EN               : 1;
        uint32_t DMAMUX1EN            : 1;
        uint32_t CORDICEN             : 1;
        uint32_t FMACEN               : 1;
        uint32_t RESERVED0   : 3;
        uint32_t FLASHEN              : 1;
        uint32_t RESERVED1   : 3;
        uint32_t CRCEN                : 1;
        uint32_t RESERVED2   : 19;
    } par;
} RCC_AHB1ENR_reg;

typedef union
{
    uint32_t val;

    struct {
        uint32_t DMA1RST              : 1;
        uint32_t DMA2RST              : 1;
        uint32_t DMAMUX1RST           : 1;
        uint32_t CORDICRST            : 1;
        uint32_t FMACRST              : 1;
        uint32_t RESERVED0   : 3;
        uint32_t FLASHRST             : 1;
        uint32_t RESERVED1   : 3;
        uint32_t CRCRST               : 1;
        uint32_t RESERVED2   : 19;
    } par;
} RCC_AHB1RSTR_reg;

typedef union
{
    uint32_t val;

    struct {
        uint32_t DMA1SMEN             : 1;
        uint32_t DMA2SMEN             : 1;
        uint32_t DMAMUX1SMEN          : 1;
        uint32_t CORDICSMEN           : 1;
        uint32_t FMACSMEN             : 1;
        uint32_t RESERVED0   : 3;
        uint32_t FLASHSMEN            : 1;
        uint32_t SRAM1SMEN            : 1;
        uint32_t RESERVED1   : 2;
        uint32_t CRCSMEN              : 1;
        uint32_t RESERVED2   : 19;
    } par;
} RCC_AHB1SMENR_reg;

typedef union
{
    uint32_t val;

    struct {
        uint32_t GPIOAEN              : 1;
        uint32_t GPIOBEN              : 1;
        uint32_t GPIOCEN              : 1;
        uint32_t GPIODEN              : 1;
        uint32_t GPIOEEN              : 1;
        uint32_t GPIOFEN              : 1;
        uint32_t GPIOGEN              : 1;
        uint32_t RESERVED0   : 6;
        uint32_t ADC12EN              : 1;
        uint32_t ADC345EN             : 1;
        uint32_t RESERVED1            : 1;
        uint32_t DAC1EN               : 1;
        uint32_t DAC2EN               : 1;
        uint32_t DAC3EN               : 1;
        uint32_t DAC4EN               : 1;
        uint32_t RESERVED2   : 6;
        uint32_t RNGEN                : 1;
        uint32_t RESERVED3   : 5;
    } par;
} RCC_AHB2ENR_reg;

typedef union
{
    uint32_t val;

    struct {
        uint32_t GPIOARST             : 1;
        uint32_t GPIOBRST             : 1;
        uint32_t GPIOCRST             : 1;
        uint32_t GPIODRST             : 1;
        uint32_t GPIOERST             : 1;
        uint32_t GPIOFRST             : 1;
        uint32_t GPIOGRST             : 1;
        uint32_t RESERVED0   : 6;
        uint32_t ADC12RST             : 1;
        uint32_t ADC345RST            : 1;
        uint32_t RESERVED1   : 1;
        uint32_t DAC1RST              : 1;
        uint32_t DAC2RST              : 1;
        uint32_t DAC3RST              : 1;
        uint32_t DAC4RST              : 1;
        uint32_t RESERVED2   : 6;
        uint32_t RNGRST               : 1;
        uint32_t RESERVED3   : 5;
    } par;
} RCC_AHB2RSTR_reg;

typedef union
{
    uint32_t val;

    struct {
        uint32_t GPIOASMEN            : 1;
        uint32_t GPIOBSMEN            : 1;
        uint32_t GPIOCSMEN            : 1;
        uint32_t GPIODSMEN            : 1;
        uint32_t GPIOESMEN            : 1;
        uint32_t GPIOFSMEN            : 1;
        uint32_t GPIOGSMEN            : 1;
        uint32_t RESERVED0   : 2;
        uint32_t CCMSRAMSMEN          : 1;
        uint32_t SRAM2SMEN            : 1;
        uint32_t RESERVED1   : 2;
        uint32_t ADC12SMEN            : 1;
        uint32_t ADC345SMEN           : 1;
        uint32_t RESERVED2   : 1;
        uint32_t DAC1SMEN             : 1;
        uint32_t DAC2SMEN             : 1;
        uint32_t DAC3SMEN             : 1;
        uint32_t DAC4SMEN             : 1;
        uint32_t RESERVED3   : 6;
        uint32_t RNGSMEN              : 1;
        uint32_t RESERVED4   : 5;
    } par;
} RCC_AHB2SMENR_reg;

typedef union
{
    uint32_t val;

    struct {
        uint32_t FMCEN                : 1;
        uint32_t RESERVED0   : 7;
        uint32_t QSPIEN               : 1;
        uint32_t RESERVED1   : 23;
    } par;
} RCC_AHB3ENR_reg;

typedef union
{
    uint32_t val;

    struct {
        uint32_t FMCRST               : 1;
        uint32_t RESERVED0   : 7;
        uint32_t QSPIRST              : 1;
        uint32_t RESERVED1   : 23;
    } par;
} RCC_AHB3RSTR_reg;

typedef union
{
    uint32_t val;

    struct {
        uint32_t FMCSMEN              : 1;
        uint32_t RESERVED0   : 7;
        uint32_t QSPISMEN             : 1;
        uint32_t RESERVED1   : 23;
    } par;
} RCC_AHB3SMENR_reg;

typedef union
{
    uint32_t val;

    struct {
        uint32_t TIM2EN               : 1;
        uint32_t TIM3EN               : 1;
        uint32_t TIM4EN               : 1;
        uint32_t TIM5EN               : 1;
        uint32_t TIM6EN               : 1;
        uint32_t TIM7EN               : 1;
        uint32_t RESERVED0   : 2;
        uint32_t CRSEN                : 1;
        uint32_t RESERVED1   : 1;
        uint32_t RTCAPBEN             : 1;
        uint32_t WWDGEN               : 1;
        uint32_t RESERVED2   : 2;
        uint32_t SPI2EN               : 1;
        uint32_t SPI3EN               : 1;
        uint32_t RESERVED3   : 1;
        uint32_t USART2EN             : 1;
        uint32_t USART3EN             : 1;
        uint32_t UART4EN              : 1;
        uint32_t UART5EN              : 1;
        uint32_t I2C1EN               : 1;
        uint32_t I2C2EN               : 1;
        uint32_t USBEN                : 1;
        uint32_t RESERVED4   : 1;
        uint32_t FDCANEN              : 1;
        uint32_t RESERVED5   : 2;
        uint32_t PWREN                : 1;
        uint32_t RESERVED6   : 1;
        uint32_t I2C3EN               : 1;
        uint32_t LPTIM1EN             : 1;
    } par;
} RCC_APB1ENR1_reg;

typedef union
{
    uint32_t val;

