BitNibble/STM32G473VET6/Support/stm32g4_register.h
    struct {
        uint32_t LPUART1EN            : 1;
        uint32_t I2C4EN               : 1;
        uint32_t RESERVED0   : 6;
        uint32_t UCPD1EN              : 1;
        uint32_t RESERVED1   : 23;
    } par;
} RCC_APB1ENR2_reg;

typedef union
{
    uint32_t val;

    struct {
        uint32_t TIM2RST              : 1;
        uint32_t TIM3RST              : 1;
        uint32_t TIM4RST              : 1;
        uint32_t TIM5RST              : 1;
        uint32_t TIM6RST              : 1;
        uint32_t TIM7RST              : 1;
        uint32_t RESERVED0   : 2;
        uint32_t CRSRST               : 1;
        uint32_t RESERVED1   : 5;
        uint32_t SPI2RST              : 1;
        uint32_t SPI3RST              : 1;
        uint32_t RESERVED2   : 1;
        uint32_t USART2RST            : 1;
        uint32_t USART3RST            : 1;
        uint32_t UART4RST             : 1;
        uint32_t UART5RST             : 1;
        uint32_t I2C1RST              : 1;
        uint32_t I2C2RST              : 1;
        uint32_t USBRST               : 1;
        uint32_t RESERVED3   : 1;
        uint32_t FDCANRST             : 1;
        uint32_t RESERVED4   : 2;
        uint32_t PWRRST               : 1;
        uint32_t RESERVED5   : 1;
        uint32_t I2C3RST              : 1;
        uint32_t LPTIM1RST            : 1;
    } par;
} RCC_APB1RSTR1_reg;

typedef union
{
    uint32_t val;

    struct {
        uint32_t LPUART1RST           : 1;
        uint32_t I2C4RST              : 1;
        uint32_t RESERVED0   : 6;
        uint32_t UCPD1RST             : 1;
        uint32_t RESERVED1   : 23;
    } par;
} RCC_APB1RSTR2_reg;

typedef union
{
    uint32_t val;

    struct {
        uint32_t TIM2SMEN             : 1;
        uint32_t TIM3SMEN             : 1;
        uint32_t TIM4SMEN             : 1;
        uint32_t TIM5SMEN             : 1;
        uint32_t TIM6SMEN             : 1;
        uint32_t TIM7SMEN             : 1;
        uint32_t RESERVED0   : 2;
        uint32_t CRSSMEN              : 1;
        uint32_t RESERVED1   : 1;
        uint32_t RTCAPBSMEN           : 1;
        uint32_t WWDGSMEN             : 1;
        uint32_t RESERVED2   : 2;
        uint32_t SPI2SMEN             : 1;
        uint32_t SPI3SMEN             : 1;
        uint32_t RESERVED3   : 1;
        uint32_t USART2SMEN           : 1;
        uint32_t USART3SMEN           : 1;
        uint32_t UART4SMEN            : 1;
        uint32_t UART5SMEN            : 1;
        uint32_t I2C1SMEN             : 1;
        uint32_t I2C2SMEN             : 1;
        uint32_t USBSMEN              : 1;
        uint32_t RESERVED4   : 1;
        uint32_t FDCANSMEN            : 1;
        uint32_t RESERVED5   : 2;
        uint32_t PWRSMEN              : 1;
        uint32_t RESERVED6   : 1;
        uint32_t I2C3SMEN             : 1;
        uint32_t LPTIM1SMEN           : 1;
    } par;
} RCC_APB1SMENR1_reg;

typedef union
{
    uint32_t val;

    struct {
        uint32_t LPUART1SMEN          : 1;
        uint32_t I2C4SMEN             : 1;
        uint32_t RESERVED0   : 6;
        uint32_t UCPD1SMEN            : 1;
        uint32_t RESERVED1   : 23;
    } par;
} RCC_APB1SMENR2_reg;

typedef union
{
    uint32_t val;

    struct {
        uint32_t SYSCFGEN             : 1;
        uint32_t RESERVED0   : 10;
        uint32_t TIM1EN               : 1;
        uint32_t SPI1EN               : 1;
        uint32_t TIM8EN               : 1;
        uint32_t USART1EN             : 1;
        uint32_t SPI4EN               : 1;
        uint32_t TIM15EN              : 1;
        uint32_t TIM16EN              : 1;
        uint32_t TIM17EN              : 1;
        uint32_t RESERVED1   : 1;
        uint32_t TIM20EN              : 1;
        uint32_t SAI1EN               : 1;
        uint32_t RESERVED2   : 10;
    } par;
} RCC_APB2ENR_reg;

typedef union
{
    uint32_t val;

    struct {
        uint32_t SYSCFGRST            : 1;
        uint32_t RESERVED0   : 10;
        uint32_t TIM1RST              : 1;
        uint32_t SPI1RST              : 1;
        uint32_t TIM8RST              : 1;
        uint32_t USART1RST            : 1;
        uint32_t SPI4RST              : 1;
        uint32_t TIM15RST             : 1;
        uint32_t TIM16RST             : 1;
        uint32_t TIM17RST             : 1;
        uint32_t RESERVED1   : 1;
        uint32_t TIM20RST             : 1;
        uint32_t SAI1RST              : 1;
        uint32_t RESERVED2   : 10;
    } par;
} RCC_APB2RSTR_reg;

typedef union
{
    uint32_t val;

    struct {
        uint32_t SYSCFGSMEN           : 1;
        uint32_t RESERVED0   : 10;
        uint32_t TIM1SMEN             : 1;
        uint32_t SPI1SMEN             : 1;
        uint32_t TIM8SMEN             : 1;
        uint32_t USART1SMEN           : 1;
        uint32_t SPI4SMEN             : 1;
        uint32_t TIM15SMEN            : 1;
        uint32_t TIM16SMEN            : 1;
        uint32_t TIM17SMEN            : 1;
        uint32_t RESERVED1   : 1;
        uint32_t TIM20SMEN            : 1;
        uint32_t SAI1SMEN             : 1;
        uint32_t RESERVED2   : 10;
    } par;
} RCC_APB2SMENR_reg;

typedef union
{
    uint32_t val;

    struct {
        uint32_t LSEON                : 1;
        uint32_t LSERDY               : 1;
        uint32_t LSEBYP               : 1;
        uint32_t LSEDRV               : 2;
        uint32_t LSECSSON             : 1;
        uint32_t LSECSSD              : 1;
        uint32_t RESERVED0   : 1;
        uint32_t RTCSEL               : 2;
        uint32_t RESERVED1   : 5;
        uint32_t RTCEN                : 1;
        uint32_t BDRST                : 1;
        uint32_t RESERVED2   : 7;
        uint32_t LSCOEN               : 1;
        uint32_t LSCOSEL              : 1;
        uint32_t RESERVED3   : 6;
    } par;
} RCC_BDCR_reg;

typedef union
{
    uint32_t val;

    struct {
        uint32_t USART1SEL            : 2;
        uint32_t USART2SEL            : 2;
        uint32_t USART3SEL            : 2;
        uint32_t UART4SEL             : 2;
        uint32_t UART5SEL             : 2;
        uint32_t LPUART1SEL           : 2;
        uint32_t I2C1SEL              : 2;
        uint32_t I2C2SEL              : 2;
        uint32_t I2C3SEL              : 2;
        uint32_t LPTIM1SEL            : 2;
        uint32_t SAI1SEL              : 2;
        uint32_t I2S23SEL             : 2;
        uint32_t FDCANSEL             : 2;
        uint32_t CLK48SEL             : 2;
        uint32_t ADC12SEL             : 2;
        uint32_t ADC345SEL            : 2;
    } par;
} RCC_CCIPR_reg;

typedef union
{
    uint32_t val;

