BitNibble/STM32G473VET6/Support/stm32g4_register.h
    struct {
        uint32_t I2C4SEL              : 2;
        uint32_t RESERVED0   : 18;
        uint32_t QSPISEL              : 2;
        uint32_t RESERVED1   : 10;
    } par;
} RCC_CCIPR2_reg;

typedef union
{
    uint32_t val;

    struct {
        uint32_t SW                   : 2;
        uint32_t SWS                  : 2;
        uint32_t HPRE                 : 4;
        uint32_t PPRE1                : 3;
        uint32_t PPRE2                : 3;
        uint32_t RESERVED0   : 10;
        uint32_t MCOSEL               : 4;
        uint32_t MCOPRE               : 3;
        uint32_t RESERVED1   : 1;
    } par;
} RCC_CFGR_reg;

typedef union
{
    uint32_t val;

    struct {
        uint32_t LSIRDYC              : 1;
        uint32_t LSERDYC              : 1;
        uint32_t RESERVED0   : 1;
        uint32_t HSIRDYC              : 1;
        uint32_t HSERDYC              : 1;
        uint32_t PLLRDYC              : 1;
        uint32_t RESERVED1   : 2;
        uint32_t CSSC                 : 1;
        uint32_t LSECSSC              : 1;
        uint32_t HSI48RDYC            : 1;
        uint32_t RESERVED2   : 21;
    } par;
} RCC_CICR_reg;

typedef union
{
    uint32_t val;

    struct {
        uint32_t LSIRDYIE             : 1;
        uint32_t LSERDYIE             : 1;
        uint32_t RESERVED0   : 1;
        uint32_t HSIRDYIE             : 1;
        uint32_t HSERDYIE             : 1;
        uint32_t PLLRDYIE             : 1;
        uint32_t RESERVED1   : 3;
        uint32_t LSECSSIE             : 1;
        uint32_t HSI48RDYIE           : 1;
        uint32_t RESERVED2   : 21;
    } par;
} RCC_CIER_reg;

typedef union
{
    uint32_t val;

    struct {
        uint32_t LSIRDYF              : 1;
        uint32_t LSERDYF              : 1;
        uint32_t RESERVED0   : 1;
        uint32_t HSIRDYF              : 1;
        uint32_t HSERDYF              : 1;
        uint32_t PLLRDYF              : 1;
        uint32_t RESERVED1   : 2;
        uint32_t CSSF                 : 1;
        uint32_t LSECSSF              : 1;
        uint32_t HSI48RDYF            : 1;
        uint32_t RESERVED2   : 21;
    } par;
} RCC_CIFR_reg;

typedef union
{
    uint32_t val;

    struct {
        uint32_t RESERVED0   : 8;
        uint32_t HSION                : 1;
        uint32_t HSIKERON             : 1;
        uint32_t HSIRDY               : 1;
        uint32_t RESERVED1   : 5;
        uint32_t HSEON                : 1;
        uint32_t HSERDY               : 1;
        uint32_t HSEBYP               : 1;
        uint32_t CSSON                : 1;
        uint32_t RESERVED2   : 4;
        uint32_t PLLON                : 1;
        uint32_t PLLRDY               : 1;
        uint32_t RESERVED3   : 6;
    } par;
} RCC_CR_reg;

typedef union
{
    uint32_t val;

    struct {
        uint32_t HSI48ON              : 1;
        uint32_t HSI48RDY             : 1;
        uint32_t RESERVED0   : 5;
        uint32_t HSI48CAL             : 2;
        uint32_t RESERVED1   : 23;
    } par;
} RCC_CRRCR_reg;

typedef union
{
    uint32_t val;

    struct {
        uint32_t LSION                : 1;
        uint32_t LSIRDY               : 1;
        uint32_t RESERVED0   : 21;
        uint32_t RMVF                 : 1;
        uint32_t RESERVED1   : 1;
        uint32_t OBLRSTF              : 1;
        uint32_t PINRSTF              : 1;
        uint32_t BORRSTF              : 1;
        uint32_t SFTRSTF              : 1;
        uint32_t IWDGRSTF             : 1;
        uint32_t WWDGRSTF             : 1;
        uint32_t LPWRRSTF             : 1;
    } par;
} RCC_CSR_reg;

typedef union
{
    uint32_t val;

    struct {
        uint32_t RESERVED0   : 16;
        uint32_t HSICAL               : 8;
        uint32_t HSITRIM              : 7;
        uint32_t RESERVED1   : 1;
    } par;
} RCC_ICSCR_reg;

typedef union
{
    uint32_t val;

    struct {
        uint32_t PLLSRC               : 2;
        uint32_t RESERVED0   : 2;
        uint32_t PLLM                 : 4;
        uint32_t PLLN                 : 7;
        uint32_t RESERVED1   : 1;
        uint32_t PLLPEN               : 1;
        uint32_t PLLP                 : 1;
        uint32_t RESERVED2   : 2;
        uint32_t PLLQEN               : 1;
        uint32_t PLLQ                 : 2;
        uint32_t RESERVED3   : 1;
        uint32_t PLLREN               : 1;
        uint32_t PLLR                 : 2;
        uint32_t PLLPDIV              : 5;
    } par;
} RCC_PLLCFGR_reg;

typedef union { 
	uint32_t val;

	struct {
	  uint32_t MODE0  : 2;
	  uint32_t MODE1  : 2;
	  uint32_t MODE2  : 2;
	  uint32_t MODE3  : 2;
	  uint32_t MODE4  : 2;
	  uint32_t MODE5  : 2;
	  uint32_t MODE6  : 2;
	  uint32_t MODE7  : 2;
	  uint32_t MODE8  : 2;
	  uint32_t MODE9  : 2;
	  uint32_t MODE10 : 2;
	  uint32_t MODE11 : 2;
	  uint32_t MODE12 : 2;
	  uint32_t MODE13 : 2;
	  uint32_t MODE14 : 2;
	  uint32_t MODE15 : 2;
	} par;
} GPIO_MODER_reg;

typedef union { 
	uint32_t val;

	struct {
	  uint32_t OT0       : 1;
	  uint32_t OT1       : 1;
	  uint32_t OT2       : 1;
	  uint32_t OT3       : 1;
	  uint32_t OT4       : 1;
	  uint32_t OT5       : 1;
	  uint32_t OT6       : 1;
	  uint32_t OT7       : 1;
	  uint32_t OT8       : 1;
	  uint32_t OT9       : 1;
	  uint32_t OT10      : 1;
	  uint32_t OT11      : 1;
	  uint32_t OT12      : 1;
	  uint32_t OT13      : 1;
	  uint32_t OT14      : 1;
	  uint32_t OT15      : 1;
	  uint32_t Reserved  : 16;
	} par;
} GPIO_OTYPER_reg;

typedef union { 
	uint32_t val;

	struct {
	  uint32_t OSPEED0  : 2;
	  uint32_t OSPEED1  : 2;
	  uint32_t OSPEED2  : 2;
	  uint32_t OSPEED3  : 2;
	  uint32_t OSPEED4  : 2;
	  uint32_t OSPEED5  : 2;
	  uint32_t OSPEED6  : 2;
	  uint32_t OSPEED7  : 2;
	  uint32_t OSPEED8  : 2;
	  uint32_t OSPEED9  : 2;
	  uint32_t OSPEED10 : 2;
	  uint32_t OSPEED11 : 2;
	  uint32_t OSPEED12 : 2;
	  uint32_t OSPEED13 : 2;
	  uint32_t OSPEED14 : 2;
	  uint32_t OSPEED15 : 2;
	} par;
} GPIO_OSPEEDR_reg;

typedef union { 
	uint32_t val;

