BitNibble/STM32G473VET6/Support/stm32g4_register.h
	struct {
	  uint32_t PUPD0  : 2;
	  uint32_t PUPD1  : 2;
	  uint32_t PUPD2  : 2;
	  uint32_t PUPD3  : 2;
	  uint32_t PUPD4  : 2;
	  uint32_t PUPD5  : 2;
	  uint32_t PUPD6  : 2;
	  uint32_t PUPD7  : 2;
	  uint32_t PUPD8  : 2;
	  uint32_t PUPD9  : 2;
	  uint32_t PUPD10 : 2;
	  uint32_t PUPD11 : 2;
	  uint32_t PUPD12 : 2;
	  uint32_t PUPD13 : 2;
	  uint32_t PUPD14 : 2;
	  uint32_t PUPD15 : 2;
	} par;
} GPIO_PUPDR_reg;

typedef union { 
	uint32_t val;

	struct {
	  uint32_t ID0       : 1;
	  uint32_t ID1       : 1;
	  uint32_t ID2       : 1;
	  uint32_t ID3       : 1;
	  uint32_t ID4       : 1;
	  uint32_t ID5       : 1;
	  uint32_t ID6       : 1;
	  uint32_t ID7       : 1;
	  uint32_t ID8       : 1;
	  uint32_t ID9       : 1;
	  uint32_t ID10      : 1;
	  uint32_t ID11      : 1;
	  uint32_t ID12      : 1;
	  uint32_t ID13      : 1;
	  uint32_t ID14      : 1;
	  uint32_t ID15      : 1;
	  uint32_t Reserved  : 16;
	} par;
} GPIO_IDR_reg;

typedef union { 
	uint32_t val;

	struct {
	  uint32_t OD0       : 1;
	  uint32_t OD1       : 1;
	  uint32_t OD2       : 1;
	  uint32_t OD3       : 1;
	  uint32_t OD4       : 1;
	  uint32_t OD5       : 1;
	  uint32_t OD6       : 1;
	  uint32_t OD7       : 1;
	  uint32_t OD8       : 1;
	  uint32_t OD9       : 1;
	  uint32_t OD10      : 1;
	  uint32_t OD11      : 1;
	  uint32_t OD12      : 1;
	  uint32_t OD13      : 1;
	  uint32_t OD14      : 1;
	  uint32_t OD15      : 1;
	  uint32_t Reserved  : 16;
	} par;
} GPIO_ODR_reg;

typedef union { 
	uint32_t val;

	struct {
	  uint32_t LCK0      : 1;
	  uint32_t LCK1      : 1;
	  uint32_t LCK2      : 1;
	  uint32_t LCK3      : 1;
	  uint32_t LCK4      : 1;
	  uint32_t LCK5      : 1;
	  uint32_t LCK6      : 1;
	  uint32_t LCK7      : 1;
	  uint32_t LCK8      : 1;
	  uint32_t LCK9      : 1;
	  uint32_t LCK10     : 1;
	  uint32_t LCK11     : 1;
	  uint32_t LCK12     : 1;
	  uint32_t LCK13     : 1;
	  uint32_t LCK14     : 1;
	  uint32_t LCK15     : 1;
	  uint32_t LCKK      : 1;
	  uint32_t Reserved  : 15;
	} par;
} GPIO_LCKR_reg;

typedef union {
	uint32_t reg[2];

	struct {
	  uint32_t AFSEL0  : 4;  uint32_t AFSEL1  : 4;  uint32_t AFSEL2  : 4;  uint32_t AFSEL3  : 4;
	  uint32_t AFSEL4  : 4;  uint32_t AFSEL5  : 4;  uint32_t AFSEL6  : 4;  uint32_t AFSEL7  : 4;
	  uint32_t AFSEL8  : 4;  uint32_t AFSEL9  : 4;  uint32_t AFSEL10 : 4;  uint32_t AFSEL11 : 4;
	  uint32_t AFSEL12 : 4;  uint32_t AFSEL13 : 4;  uint32_t AFSEL14 : 4;  uint32_t AFSEL15 : 4;
	} par;
} GPIO_AFR_reg;

typedef union
{
    uint32_t val;

    struct
    {
        uint32_t PE          : 1;   // Bit 0
        uint32_t TXIE        : 1;   // Bit 1
        uint32_t RXIE        : 1;   // Bit 2
        uint32_t ADDRIE      : 1;   // Bit 3
        uint32_t NACKIE      : 1;   // Bit 4
        uint32_t STOPIE      : 1;   // Bit 5
        uint32_t TCIE        : 1;   // Bit 6
        uint32_t ERRIE       : 1;   // Bit 7
        uint32_t DNF         : 4;   // Bits 8-11
        uint32_t ANFOFF      : 1;   // Bit 12
        uint32_t SWRST       : 1;   // Bit 13
        uint32_t TXDMAEN     : 1;   // Bit 14
        uint32_t RXDMAEN     : 1;   // Bit 15
        uint32_t SBC         : 1;   // Bit 16
        uint32_t NOSTRETCH   : 1;   // Bit 17
        uint32_t WUPEN       : 1;   // Bit 18
        uint32_t GCEN        : 1;   // Bit 19
        uint32_t SMBHEN      : 1;   // Bit 20
        uint32_t SMBDEN      : 1;   // Bit 21
        uint32_t ALERTEN     : 1;   // Bit 22
        uint32_t PECEN       : 1;   // Bit 23
        uint32_t RESERVED    : 8;   // Bits 24-31

    } par;

} I2C_CR1_reg;

typedef union
{
    uint32_t val;

    struct
    {
        uint32_t SADD        :10;   // Bits 0-9
        uint32_t RD_WRN      : 1;   // Bit 10
        uint32_t ADD10       : 1;   // Bit 11
        uint32_t HEAD10R     : 1;   // Bit 12
        uint32_t START       : 1;   // Bit 13
        uint32_t STOP        : 1;   // Bit 14
        uint32_t NACK        : 1;   // Bit 15
        uint32_t NBYTES      : 8;   // Bits 16-23
        uint32_t RELOAD      : 1;   // Bit 24
        uint32_t AUTOEND     : 1;   // Bit 25
        uint32_t PECBYTE     : 1;   // Bit 26
        uint32_t RESERVED    : 5;   // Bits 27-31

    } par;

} I2C_CR2_reg;

typedef union
{
    uint32_t val;

    struct
    {
        uint32_t OA1         :10;   // Bits 0-9
        uint32_t OA1MODE     : 1;   // Bit 10
        uint32_t RESERVED0   : 4;   // Bits 11-14
        uint32_t OA1EN       : 1;   // Bit 15
        uint32_t RESERVED1   :16;   // Bits 16-31

    } par;

} I2C_OAR1_reg;

typedef union
{
    uint32_t val;

    struct
    {
        uint32_t RESERVED0   : 1;   // Bit 0
        uint32_t OA2         : 7;   // Bits 1-7
        uint32_t OA2MSK      : 3;   // Bits 8-10
        uint32_t RESERVED1   : 4;   // Bits 11-14
        uint32_t OA2EN       : 1;   // Bit 15
        uint32_t RESERVED2   :16;   // Bits 16-31

    } par;

} I2C_OAR2_reg;

typedef union
{
    uint32_t val;

    struct
    {
        uint32_t SCLL        : 8;   // Bits 0-7
        uint32_t SCLH        : 8;   // Bits 8-15
        uint32_t SDADEL      : 4;   // Bits 16-19
        uint32_t SCLDEL      : 4;   // Bits 20-23
        uint32_t RESERVED    : 4;   // Bits 24-27
        uint32_t PRESC       : 4;   // Bits 28-31

    } par;

} I2C_TIMINGR_reg;

typedef union
{
    uint32_t val;

    struct
    {
        uint32_t TIMEOUTA    :12;   // Bits 0-11
        uint32_t TIDLE       : 1;   // Bit 12
        uint32_t RESERVED0   : 2;   // Bits 13-14
        uint32_t TIMOUTEN    : 1;   // Bit 15
        uint32_t TIMEOUTB    :12;   // Bits 16-27
        uint32_t RESERVED1   : 3;   // Bits 28-30
        uint32_t TEXTEN      : 1;   // Bit 31

    } par;

} I2C_TIMEOUTR_reg;

typedef union
{
    uint32_t val;

    struct
    {
        uint32_t TXE         : 1;   // Bit 0
        uint32_t TXIS        : 1;   // Bit 1
        uint32_t RXNE        : 1;   // Bit 2
        uint32_t ADDR        : 1;   // Bit 3
        uint32_t NACKF       : 1;   // Bit 4
        uint32_t STOPF       : 1;   // Bit 5
        uint32_t TC          : 1;   // Bit 6
        uint32_t TCR         : 1;   // Bit 7
        uint32_t BERR        : 1;   // Bit 8
        uint32_t ARLO        : 1;   // Bit 9
        uint32_t OVR         : 1;   // Bit 10
        uint32_t PECERR      : 1;   // Bit 11
        uint32_t TIMEOUT     : 1;   // Bit 12
        uint32_t ALERT       : 1;   // Bit 13
        uint32_t RESERVED0   : 1;   // Bit 14
        uint32_t BUSY        : 1;   // Bit 15
        uint32_t DIR         : 1;   // Bit 16
        uint32_t ADDCODE     : 7;   // Bits 17-23
        uint32_t RESERVED1   : 8;   // Bits 24-31

    } par;

} I2C_ISR_reg;

typedef union
{
    uint32_t val;

    struct
    {
        uint32_t RESERVED0   : 3;   // Bits 0-2
        uint32_t ADDRCF      : 1;   // Bit 3
        uint32_t NACKCF      : 1;   // Bit 4
        uint32_t STOPCF      : 1;   // Bit 5
        uint32_t RESERVED1   : 2;   // Bits 6-7
        uint32_t BERRCF      : 1;   // Bit 8
        uint32_t ARLOCF      : 1;   // Bit 9
        uint32_t OVRCF       : 1;   // Bit 10
        uint32_t PECCF       : 1;   // Bit 11
        uint32_t TIMOUTCF    : 1;   // Bit 12
        uint32_t ALERTCF     : 1;   // Bit 13
        uint32_t RESERVED2   :18;   // Bits 14-31

    } par;

} I2C_ICR_reg;

typedef union
{
    uint32_t val;

    struct
    {
        uint32_t PEC         : 8;   // Bits 0-7
        uint32_t RESERVED    :24;   // Bits 8-31

    } par;

} I2C_PECR_reg;

typedef union
{
    uint32_t val;

    struct
    {
        uint32_t RXDATA      : 8;   // Bits 0-7
        uint32_t RESERVED    :24;   // Bits 8-31

    } par;

} I2C_RXDR_reg;

typedef union
{
    uint32_t val;

    struct
    {
        uint32_t TXDATA      : 8;   // Bits 0-7
        uint32_t RESERVED    :24;   // Bits 8-31

    } par;

} I2C_TXDR_reg;

#endif

